Directive : 앵귤러의 디렉티브는 확장된 HTML을 의미하는데, 
커스텀 속성이나 커스텀 엘리먼트를 정의 할 수 있다.

태그에 있는 속성도 직접 정의할 수 있고, 앵귤러에 정의 되어있는 내장 함수가 따로 있고 필요할 때는 만들 수 있다.

Expressions: 앵귤러에서는 익스프레션 기법으로 자바스크립트를 출력할 수 있다.

Modules: 앵귤러에서는 디렉티브, 컨트롤러, 서비스 같은 것을 모아놓은 것을 모듈이라고 한다.

모듈끼리는 서로 의존관계가 있는 경우에 다른 모델을 주입받아서 쓸수 있다.

Controller : 앵귤러의 Html 뒷단에 있는 것이고, view를 컨트롤 하는 역할.

컨트롤러를 사용할때 주의점
	- HTML DOM을 조작할때는 컨트롤러를 쓰면 안됨
	- Input 필드를 조절할때도 쓰면 안됨

컨트롤러는 뷰의 비지니스 로직을 다룰때만 사용
	- 근데 비지니스 로직이 뭐지

Service - 싱글톤으로 구현 , 어플리케이션의 데이터를 관리할 때 사용하면 좋다.
 


ng-app : 바디코드에 ng-app이라고 넣으면 이 밑의 코드는 앵귤러 코드가 정의 되어 있다고 하는 말임.

ng-init : 자바스크립트의 변수나 함수를 초기화하는 요소

expression (표현식)
	- 인터폴레이션 : {{ NAME }} : 중괄호 사이에 넣는다.

 var app = angular.module('todo', []); 
-> 여기서 첫번째 매개변수는 모듈이름을 넣고 두번째 매개변수에는 배열을 넣는다.

모듈을 적용하는 방법은 위에 자바스크립트에 정의한 모듈이름을 ng-app에 할당한다.

<body ng-app="todo">

모듈이라는 것은 하나의 큰 컨테이너이다.
그래서 컨트롤러를 만들때 모듈 안에 만들어야함 여기서는 todo 안에 만들기

app.controller('TodoCtrl', ['$scope', function($scope) {
	$scope.name = 'Chris';
}]);
	- 첫번째 인자로는 컨트롤러의 이름을 넣는다 이때 관례적으로 첫번째 문자를 대문자로 한다. 두번째인자로는 함수를 넣는다.
	- 특이한게 있는데, 두번째 에 배열로 하는 것이다.
	- 배열안의 첫번째로는 스코프를 넣고, 함수에는 스코프를 매개변수로 주입한다.
	- 스코프는 컨트롤러와 뷰(HTML)간의 연결고리 역할이다.


ng-model : 양방향 바인딩이다.
